In [52]:
import pandas as pd

                                              FUNCAO APPLY

In [53]:
df = pd.DataFrame({ 'A': [1, 2, 3, 4],
                    'B': [10, 20, 30, 40],
                 'C': [100, 200, 300, 400]},
                 index=['Linha 1', 'Linha 2', 'Linha 3', 'Linha 4'])

 <img style="width:600px" src='axis.jpg' alt= 'axis'>

In [54]:
df

         A   B    C
Linha 1  1  10  100
Linha 2  2  20  200
Linha 3  3  30  300
Linha 4  4  40  400

In [55]:
def nossa_soma(linha):
    return linha.sum()

In [56]:
df['SOMA (A,B,C)'] = df.apply(nossa_soma, axis= 1)

In [57]:
df

         A   B    C  SOMA (A,B,C)
Linha 1  1  10  100           111
Linha 2  2  20  200           222
Linha 3  3  30  300           333
Linha 4  4  40  400           444

In [58]:
df.apply(nossa_soma, axis= 0)

A                 10
B                100
C               1000
SOMA (A,B,C)    1110
dtype: int64

In [59]:
df.loc['Linha 5'] = df.apply(nossa_soma, axis= 0)

In [60]:
df

          A    B     C  SOMA (A,B,C)
Linha 1   1   10   100           111
Linha 2   2   20   200           222
Linha 3   3   30   300           333
Linha 4   4   40   400           444
Linha 5  10  100  1000          1110

In [61]:
def nossa_media(linha):
    return linha.mean()

In [62]:
df['MEDIA TOTAL'] = df.apply(nossa_media, axis= 1)
df

          A    B     C  SOMA (A,B,C)  MEDIA TOTAL
Linha 1   1   10   100           111         55.5
Linha 2   2   20   200           222        111.0
Linha 3   3   30   300           333        166.5
Linha 4   4   40   400           444        222.0
Linha 5  10  100  1000          1110        555.0

In [63]:
df.loc['Linha 6'] = df.apply(nossa_media, axis= 0)
df

            A      B       C  SOMA (A,B,C)  MEDIA TOTAL
Linha 1   1.0   10.0   100.0         111.0         55.5
Linha 2   2.0   20.0   200.0         222.0        111.0
Linha 3   3.0   30.0   300.0         333.0        166.5
Linha 4   4.0   40.0   400.0         444.0        222.0
Linha 5  10.0  100.0  1000.0        1110.0        555.0
Linha 6   4.0   40.0   400.0         444.0        222.0

USANDO FUNÇÃO LAMBDA

In [64]:
df['MEAN (A,B,C)'] = df[['A', 'B', 'C']].apply(lambda series: series.mean(), axis= 1)

In [65]:
df

            A      B       C  SOMA (A,B,C)  MEDIA TOTAL  MEAN (A,B,C)
Linha 1   1.0   10.0   100.0         111.0         55.5          37.0
Linha 2   2.0   20.0   200.0         222.0        111.0          74.0
Linha 3   3.0   30.0   300.0         333.0        166.5         111.0
Linha 4   4.0   40.0   400.0         444.0        222.0         148.0
Linha 5  10.0  100.0  1000.0        1110.0        555.0         370.0
Linha 6   4.0   40.0   400.0         444.0        222.0         148.0

APLICA A LAMBDA ABAIXO PARA CADA ELEMENTO DA COLUNA C

In [66]:
df['C']

Linha 1     100.0
Linha 2     200.0
Linha 3     300.0
Linha 4     400.0
Linha 5    1000.0
Linha 6     400.0
Name: C, dtype: float64

In [70]:
df['C * 2'] = df['C'].apply(lambda x: x * 2)
df

            A      B       C  SOMA (A,B,C)  MEDIA TOTAL  MEAN (A,B,C)   C * 2
Linha 1   1.0   10.0   100.0         111.0         55.5          37.0   200.0
Linha 2   2.0   20.0   200.0         222.0        111.0          74.0   400.0
Linha 3   3.0   30.0   300.0         333.0        166.5         111.0   600.0
Linha 4   4.0   40.0   400.0         444.0        222.0         148.0   800.0
Linha 5  10.0  100.0  1000.0        1110.0        555.0         370.0  2000.0
Linha 6   4.0   40.0   400.0         444.0        222.0         148.0   800.0

In [72]:
df['A * 2'] = df['A'] * 2
df

,A,B,C,"SOMA (A,B,C)",MEDIA TOTAL,"MEAN (A,B,C)",C * 2,A * 2
Linha 1,1.0,10.0,100.0,111.0,55.5,37.0,200.0,2.0
Linha 2,2.0,20.0,200.0,222.0,111.0,74.0,400.0,4.0
Linha 3,3.0,30.0,300.0,333.0,166.5,111.0,600.0,6.0
Linha 4,4.0,40.0,400.0,444.0,222.0,148.0,800.0,8.0
Linha 5,10.0,100.0,1000.0,1110.0,555.0,370.0,2000.0,20.0
Linha 6,4.0,40.0,400.0,444.0,222.0,148.0,800.0,8.0

                                                  FUNCAO APPLY MAP

USADA PARA APLICAR UMA FUNCAO PARA CADA ELEMENTO DE UM DATA FRAME

In [73]:
df = pd.DataFrame({ 'A': [1, 2, 3, 4],
                    'B': [10, 20, 30, 40],
                 'C': [100, 200, 300, 400]},
                 index=['Linha 1', 'Linha 2', 'Linha 3', 'Linha 4'])

In [74]:
#retorna um novo dataframe com todos os elementos ao quadrado.
df.applymap(lambda x: x ** 2)

          A     B       C
Linha 1   1   100   10000
Linha 2   4   400   40000
Linha 3   9   900   90000
Linha 4  16  1600  160000

                                                      FUNCAO MAP

E USADO PARA APLICAR UMA FUNCAO PARA CADA ELEMENTO DE UMA SERIES

In [75]:
nomes = pd.Series(['Joao', 'Maria', 'Alice', 'Pedro'])

In [76]:
nomes.map(lambda x: x.upper())

0     JOAO
1    MARIA
2    ALICE
3    PEDRO
dtype: object

OU

In [77]:
nomes.str.upper()

0     JOAO
1    MARIA
2    ALICE
3    PEDRO
dtype: object